import pandas as pd

danni = pd.DataFrame({'Код товару': [10, 10, 10, 20, 20, 20, 30, 30, 30],
                    'Назва товару': ['Яловичина', 'Яловичина', 'Яловичина', 'Свинина', 'Свинина', 'Свинина','Сало', 'Сало', 'Сало'],
                    'Місяць': ['Серпень', 'Вересень', 'Жовтень','Серпень', 'Вересень', 'Жовтень', 'Серпень', 'Вересень', 'Жовтень'],
                    'Середня ринкова ціна за місяць': [25.88, 24.00, 25.25, 25.43, 26.08, 26.95,14.48, 14.73, 15.65],
                    'Роздрібна ціна': [25.50, 25.50, 25.50, 26.50, 26.50, 26.50, 15.00, 15.00, 15.00],
                    'Рівень зміни цін': [1.01, 0.94, 0.99, 0.96, 0.98, 1.02, 0.97, 0.98, 1.04]})
danni.to_excel('./tablica.xlsx', sheet_name='Аналіз зміни рівня ринкових цін', index=False)